Revit 2026 API

# ExternalFileReferenceIsValidPathTypeForExternalFileReference Method

---

Checks whether a PathType enum value will be valid to use with this ExternalFileReference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidPathTypeForExternalFileReference(
	PathType pathType
)
```
```vb
Public Function IsValidPathTypeForExternalFileReference (
	pathType As PathType
) As Boolean
```
```cpp
public:
bool IsValidPathTypeForExternalFileReference(
	PathType pathType
)
```
```fsharp
member IsValidPathTypeForExternalFileReference :
        pathType : PathType -> bool
```

#### Parameters

pathType PathType

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

  * PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink
  * PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable, ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal

#### Reference

ExternalFileReference Class

Autodesk.Revit.DB Namespace